#Вывести данные кортежа без скобок, через запятую.
#Обязательно: элементы кортежа – строки.
a = ('я', 'иду', 'гулять')
b = ','.join(a)
print(b)
